<a href="https://colab.research.google.com/github/pearlmotwani/pearlmotwani/blob/main/AI_project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [59]:
import pandas as pd
import numpy as np

In [6]:
path="/content/drive/MyDrive/CSV/Bengaluru_House_Data.csv"
df=pd.read_csv(path)
df.head()

              area_type   availability  ... balcony   price
0  Super built-up  Area         19-Dec  ...     1.0   39.07
1            Plot  Area  Ready To Move  ...     3.0  120.00
2        Built-up  Area  Ready To Move  ...     3.0   62.00
3  Super built-up  Area  Ready To Move  ...     1.0   95.00
4  Super built-up  Area  Ready To Move  ...     1.0   51.00

[5 rows x 9 columns]

In [7]:
df.shape

(13320, 9)

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13200 non-null  float64
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(4), object(5)
memory usage: 936.7+ KB

In [65]:
for column in df.columns:
  print(df[column].value_counts())
  print("*"*20)

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64
********************
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
15-Aug               1
16-Jul               1
16-Oct               1
14-Nov               1
15-Jun               1
Name: availability, Length: 81, dtype: int64
********************
Whitefield                    540
Sarjapur  Road                399
Electronic City               302
Kanakpura Road                273
Thanisandra                   234
                             ...
Yemlur, Old Airport Road,       1
Thirumalashettyhally            1
Kanakadasa Layout               1
Yelahanka,MVIT college          1
1 Immadihalli                   1
Name: location, Length: 1305, dtype: int64
********************
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
16 BHK           1
13 BHK           1
12 Bedroom       1
43 Bedroom       1
14 BHK           1
27 BHK           1
18 Bedroom       1
19 BHK           1
Name: size, dtype: int64
********************
GrrvaGr    80
PrarePa    76
Prtates    59
Sryalan    59
GMown E    56
           ..
Suleyli     1
Foinade     1
OsrdsOr     1
ALoraAu     1
Atreli      1
Name: society, Length: 2688, dtype: int64
********************
1200.00    843
1100.00    221
1500.00    204
2400.00    195
600.00     180
          ...
892.00       1
1609.00      1
1542.14      1
4046.00      1
1915.00      1
Name: total_sqft, Length: 1972, dtype: int64
********************
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
18.0       1
40.0       1
15.0       1
14.0       1
Name: bath, dtype: int64
********************
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: balcony, dtype: int64
********************
75.00    310
65.00    302
55.00    275
60.00    270
45.00    240
        ...
81.55      1
69.49      1
42.18      1
70.25      1
74.82      1
Name: price, Length: 1994, dtype: int64
********************

In [67]:
df.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft       120
bath              73
balcony          609
price              0
dtype: int64

In [69]:
df.drop(columns=['area_type','society','balcony','availability'],inplace=True)
df.head()

                   location       size  total_sqft  bath   price
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00
2               Uttarahalli      3 BHK      1440.0   2.0   62.00
3        Lingadheeranahalli      3 BHK      1521.0   3.0   95.00
4                  Kothanur      2 BHK      1200.0   2.0   51.00

In [68]:
df.describe()

         total_sqft          bath       balcony         price
count  13200.000000  13247.000000  12711.000000  13320.000000
mean    1555.302783      2.692610      1.584376    112.565627
std     1237.323445      1.341458      0.817263    148.971674
min        1.000000      1.000000      0.000000      8.000000
25%     1100.000000      2.000000      1.000000     50.000000
50%     1275.000000      2.000000      2.000000     72.000000
75%     1672.000000      3.000000      2.000000    120.000000
max    52272.000000     40.000000      3.000000   3600.000000

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13319 non-null  object
 1   size        13304 non-null  object
 2   total_sqft  13200 non-null  float64
 3   bath        13247 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(3), object(2)
memory usage: 520.4+ KB

In [71]:
df['location'].value_counts()

Whitefield                    540
Sarjapur  Road                399
Electronic City               302
Kanakpura Road                273
Thanisandra                   234
                             ...
Yemlur, Old Airport Road,       1
Thirumalashettyhally            1
Kanakadasa Layout               1
Yelahanka,MVIT college          1
1 Immadihalli                   1
Name: location, Length: 1305, dtype: int64

In [73]:
df['location']=df['location'].fillna('Sarjapur Road')

In [74]:
df['size'].value_counts()

2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
16 BHK           1
13 BHK           1
12 Bedroom       1
43 Bedroom       1
14 BHK           1
27 BHK           1
18 Bedroom       1
19 BHK           1
Name: size, dtype: int64

In [76]:
df['size']=df['size'].fillna('2 BHK')
df['bath']=df['bath'].fillna(df['bath'].median())

In [77]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13320 non-null  object
 1   size        13320 non-null  object
 2   total_sqft  13200 non-null  float64
 3   bath        13320 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(3), object(2)
memory usage: 520.4+ KB

In [95]:
df['bhk']=df['size'].str.split().str.get(0).astype(int)

In [97]:
df.head()

                   location       size  total_sqft  ...   price  bhk  price_per_sqft
0  Electronic City Phase II      2 BHK      1056.0  ...   39.07    2     3699.810606
1          Chikka Tirupathi  4 Bedroom      2600.0  ...  120.00    4     4615.384615
2               Uttarahalli      3 BHK      1440.0  ...   62.00    3     4305.555556
3        Lingadheeranahalli      3 BHK      1521.0  ...   95.00    3     6245.890861
4                  Kothanur      2 BHK      1200.0  ...   51.00    2     4250.000000

[5 rows x 7 columns]

In [98]:
df['bhk'].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18])

In [85]:
df['total_sqft'].unique()

array([1056. , 2600. , 1440. , ..., 1258.5,  774. , 4689. ])

In [99]:
def convert_sqft_to_num(x):
    tokens=x.split('-')
    if len(tokens)==2:
      return(float(tokens[0])+float(tokens[1]))/2
    try:
      return float(x)
    except:
      return None

In [100]:
df.head()

                   location       size  total_sqft  ...   price  bhk  price_per_sqft
0  Electronic City Phase II      2 BHK      1056.0  ...   39.07    2     3699.810606
1          Chikka Tirupathi  4 Bedroom      2600.0  ...  120.00    4     4615.384615
2               Uttarahalli      3 BHK      1440.0  ...   62.00    3     4305.555556
3        Lingadheeranahalli      3 BHK      1521.0  ...   95.00    3     6245.890861
4                  Kothanur      2 BHK      1200.0  ...   51.00    2     4250.000000

[5 rows x 7 columns]

In [101]:
df['price_per_sqft']=df['price']*100000 /df['total_sqft']
df['price_per_sqft']

0         3699.810606
1         4615.384615
2         4305.555556
3         6245.890861
4         4250.000000
             ...
13315     6689.834926
13316    11111.111111
13317     5258.545136
13318    10407.336319
13319     3090.909091
Name: price_per_sqft, Length: 13320, dtype: float64

In [102]:
df.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13200.000000  13320.000000  13320.000000  13320.000000    1.320000e+04
mean    1555.302783      2.688814    112.565627      2.802778    7.920759e+03
std     1237.323445      1.338754    148.971674      1.294496    1.067272e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.267701e+03
50%     1275.000000      2.000000     72.000000      3.000000    5.438331e+03
75%     1672.000000      3.000000    120.000000      3.000000    7.317073e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [103]:
df['location'].value_counts()

Whitefield                    540
Sarjapur  Road                399
Electronic City               302
Kanakpura Road                273
Thanisandra                   234
                             ...
Yemlur, Old Airport Road,       1
Thirumalashettyhally            1
Yelahanka,MVIT college          1
Kanakadasa Layout               1
1 Immadihalli                   1
Name: location, Length: 1306, dtype: int64

In [104]:
df['location']=df['location'].apply(lambda x: x.strip())
location_count=df['location'].value_counts()

In [105]:
location_count

Whitefield               541
Sarjapur  Road           399
Electronic City          304
Kanakpura Road           273
Thanisandra              237
                        ...
Viswajit Layout            1
Raja Rajashweri Nagar      1
elachenahalli              1
Bharathnagar               1
Rainbow Drive              1
Name: location, Length: 1295, dtype: int64

In [108]:
location_count_less_10=location_count[location_count<=10]
location_count_less_10

Ganga Nagar              10
Gunjur Palya             10
Sector 1 HSR Layout      10
BTM 1st Stage            10
Nagappa Reddy Layout     10
                         ..
Viswajit Layout           1
Raja Rajashweri Nagar     1
elachenahalli             1
Bharathnagar              1
Rainbow Drive             1
Name: location, Length: 1054, dtype: int64

In [109]:
df['location']=df['location'].apply(lambda x: 'other' if x in location_count_less_10 else x)

In [112]:
df.describe()   #remove outliners

         total_sqft          bath         price           bhk  price_per_sqft
count  13200.000000  13320.000000  13320.000000  13320.000000    1.320000e+04
mean    1555.302783      2.688814    112.565627      2.802778    7.920759e+03
std     1237.323445      1.338754    148.971674      1.294496    1.067272e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.267701e+03
50%     1275.000000      2.000000     72.000000      3.000000    5.438331e+03
75%     1672.000000      3.000000    120.000000      3.000000    7.317073e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [113]:
(df['total_sqft']/df['bhk']).describe()

count    13200.000000
mean       573.847262
std        388.079980
min          0.250000
25%        473.000000
50%        552.000000
75%        625.000000
max      26136.000000
dtype: float64

In [115]:
df=df[((df['total_sqft']/df['bhk'])>=300)]
df.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  12456.000000  12456.000000  12456.000000  12456.000000    12456.000000
mean    1590.189927      2.562781    111.187960      2.649004     6308.502826
std     1260.404795      1.080275    152.203367      0.976046     4168.127339
min      300.000000      1.000000      9.000000      1.000000      267.829813
25%     1115.000000      2.000000     49.000000      2.000000     4210.526316
50%     1300.000000      2.000000     70.000000      3.000000     5294.117647
75%     1700.000000      3.000000    115.000000      3.000000     6916.666667
max    52272.000000     16.000000   3600.000000     16.000000   176470.588235

In [117]:
df.shape

(12456, 7)

In [118]:
df.price_per_sqft.describe()

count     12456.000000
mean       6308.502826
std        4168.127339
min         267.829813
25%        4210.526316
50%        5294.117647
75%        6916.666667
max      176470.588235
Name: price_per_sqft, dtype: float64

In [120]:
def remove_outliers_sqft(data):
  data_output=pd.DataFrame()
  for key,subdata in data.groupby('location'):
    m=np.mean(subdata.price_per_sqft)

    st=np.std(subdata.price_per_sqft)

    gen_data=subdata[(subdata.price_per_sqft>(m-st)) & (subdata.price_per_sqft<=(m+st)) ]
    data_output=pd.concat([data_output,gen_data],ignore_index=True)
  return data_output
df=remove_outliers_sqft(df)
df.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  10241.000000  10241.000000  10241.000000  10241.000000    10241.000000
mean    1503.877034      2.474075     90.982730      2.572210     5657.702572
std      876.716232      0.981338     86.147549      0.896219     2266.476980
min      300.000000      1.000000     10.000000      1.000000     1250.000000
25%     1108.000000      2.000000     49.000000      2.000000     4244.762955
50%     1282.000000      2.000000     67.000000      2.000000     5172.413793
75%     1650.000000      3.000000    100.000000      3.000000     6426.099852
max    30400.000000     16.000000   2200.000000     16.000000    24509.803922

In [125]:
def bhk_outlier_remover(data):
  exclude_indices=np.array([])
  for loaction,location_data in data.groupby('location'):
      bhk_stats={}
      for bhk,bhk_data in location_data.groupby('bhk'):
          bhk_stats[bhk]={
              'mean':np.mean(bhk_data.price_per_sqft),
              'std': np.std(bhk_data.price_per_sqft),
              'count': bhk_data.shape[0]
          }
      for bhk, bhk_data in location_data.groupby('bhk'):
        stats=bhk_stats.get(bhk-1)
        if stats and stats['count']>5:
            exclude_indices=np.append(exclude_indices, bhk_data[bhk_data.price_per_sqft < (stats['mean'])].index.values)
  return data.drop(exclude_indices,axis='index')

In [126]:
df=bhk_outlier_remover(df)

In [127]:
df.shape

(7329, 7)

In [128]:
df   #clean data

                  location       size  total_sqft  ...  price  bhk  price_per_sqft
0      1st Block Jayanagar      4 BHK      2850.0  ...  428.0    4    15017.543860
1      1st Block Jayanagar      3 BHK      1630.0  ...  194.0    3    11901.840491
2      1st Block Jayanagar      3 BHK      1875.0  ...  235.0    3    12533.333333
3      1st Block Jayanagar      3 BHK      1200.0  ...  130.0    3    10833.333333
4      1st Block Jayanagar      2 BHK      1235.0  ...  148.0    2    11983.805668
...                    ...        ...         ...  ...    ...  ...             ...
10232                other      2 BHK      1200.0  ...   70.0    2     5833.333333
10233                other      1 BHK      1800.0  ...  200.0    1    11111.111111
10236                other      2 BHK      1353.0  ...  110.0    2     8130.081301
10237                other  1 Bedroom       812.0  ...   26.0    1     3201.970443
10240                other      4 BHK      3600.0  ...  400.0    4    11111.111111

[7329 rows x 7 columns]

In [129]:
df.drop(columns=['size','price_per_sqft'],inplace=True)

In [130]:
df.head()

              location  total_sqft  bath  price  bhk
0  1st Block Jayanagar      2850.0   4.0  428.0    4
1  1st Block Jayanagar      1630.0   3.0  194.0    3
2  1st Block Jayanagar      1875.0   2.0  235.0    3
3  1st Block Jayanagar      1200.0   2.0  130.0    3
4  1st Block Jayanagar      1235.0   2.0  148.0    2

In [131]:
df.to_csv("Cleaned_data.csv")

In [133]:
X=df.drop(columns=['price'])
y=df['price']

In [135]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression, Lasso, Ridge
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [136]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2,random_state=0)

In [137]:
print(X_train.shape)
print(X_test.shape)

(5863, 4)
(1466, 4)

In [139]:
# Applying Linear Regression
column_trans= make_column_transformer((OneHotEncoder(sparse=False),['location']), remainder='passthrough')

In [140]:
scaler=StandardScaler()

In [141]:
lr=LinearRegression(normalize=True)

In [143]:
pipe=make_pipeline(column_trans,scaler,lr)

In [144]:
pipe.fit(X_train,y_train)

Pipeline(memory=None,
         steps=[('columntransformer',
                 ColumnTransformer(n_jobs=None, remainder='passthrough',
                                   sparse_threshold=0.3,
                                   transformer_weights=None,
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(categories='auto',
                                                                drop=None,
                                                                dtype=<class 'numpy.float64'>,
                                                                handle_unknown='error',
                                                                sparse=False),
                                                  ['location'])],
                                   verbose=False)),
                ('standardscaler',
                 StandardScaler(copy=True, with_mean=True, with_std=True)),
                ('linearregression',
                 LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
                                  normalize=True))],
         verbose=False)

In [145]:
y_pred_lr=pipe.predict(X_test)

In [146]:
r2_score(y_test,y_pred_lr)

0.819009811748925

In [147]:
#Applying Lasso
lasso=Lasso()

In [148]:
pipe=make_pipeline(column_trans,scaler,lasso)

In [149]:
pipe.fit(X_train,y_train)

Pipeline(memory=None,
         steps=[('columntransformer',
                 ColumnTransformer(n_jobs=None, remainder='passthrough',
                                   sparse_threshold=0.3,
                                   transformer_weights=None,
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(categories='auto',
                                                                drop=None,
                                                                dtype=<class 'numpy.float64'>,
                                                                handle_unknown='error',
                                                                sparse=False),
                                                  ['location'])],
                                   verbose=False)),
                ('standardscaler',
                 StandardScaler(copy=True, with_mean=True, with_std=True)),
                ('lasso',
                 Lasso(alpha=1.0, copy_X=True, fit_intercept=True,
                       max_iter=1000, normalize=False, positive=False,
                       precompute=False, random_state=None, selection='cyclic',
                       tol=0.0001, warm_start=False))],
         verbose=False)

In [150]:
y_pred_lasso=pipe.predict(X_test)
r2_score(y_test,y_pred_lasso)

0.811394219425045

In [151]:
#Applying Ridge
ridge=Ridge()

In [152]:
pipe=make_pipeline(column_trans,scaler,ridge)

In [153]:
pipe.fit(X_train,y_train)

Pipeline(memory=None,
         steps=[('columntransformer',
                 ColumnTransformer(n_jobs=None, remainder='passthrough',
                                   sparse_threshold=0.3,
                                   transformer_weights=None,
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(categories='auto',
                                                                drop=None,
                                                                dtype=<class 'numpy.float64'>,
                                                                handle_unknown='error',
                                                                sparse=False),
                                                  ['location'])],
                                   verbose=False)),
                ('standardscaler',
                 StandardScaler(copy=True, with_mean=True, with_std=True)),
                ('ridge',
                 Ridge(alpha=1.0, copy_X=True, fit_intercept=True,
                       max_iter=None, normalize=False, random_state=None,
                       solver='auto', tol=0.001))],
         verbose=False)

In [155]:
y_pred_ridge=pipe.predict(X_test)
r2_score(y_test,y_pred_ridge)

0.8192359482282903

In [158]:
print("Linear Regression: ", r2_score(y_test,y_pred_lr))
print("Lasso: ",r2_score(y_test,y_pred_lasso))
print("Ridge: ",r2_score(y_test,y_pred_ridge))

Linear Regression:  0.819009811748925
Lasso:  0.811394219425045
Ridge:  0.8192359482282903